Revit 2026 API

# ConnectorPipeSystemType Property

---

The pipe system type of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PipeSystemType PipeSystemType { get; }
```
```vb
Public ReadOnly Property PipeSystemType As PipeSystemType
	Get
```
```cpp
public:
property PipeSystemType PipeSystemType {
	PipeSystemType get ();
}
```
```fsharp
member PipeSystemType : PipeSystemType with get
```

#### Property Value

PipeSystemType

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's domain is not DomainPiping. |
| InvalidOperationException | Thrown on failure to get pipe system type. |

Instantaneous system type at this connector, calculated according to system. For unconnected connectors, system type is undefined.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace